app/controllers/api/v1/agrees_controller.rb

    def create
        @Agree = Agree.new agree_params
        respond_to do |format|
            if @Agree.save
---
INSERT INTO "agrees" ("user_id", "opinion_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["opinion_id", 1], ["created_at", "2015-06-19 22:02:42.163543"], ["updated_at", "2015-06-19 22:02:42.163543"]]