app/controllers/api/v1/comments_controller.rb

    def create
        @comment = Comment.new comment_params
        respond_to do |format|
            if @comment.save
---
INSERT INTO "comments" ("user_id", "opinion_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["opinion_id", 1], ["description", "Não é da sua contas"], ["created_at", "2015-05-22 01:20:47.715602"], ["updated_at", "2015-05-22 01:20:47.715602"]]

    def update
        respond_to do |format|
            if @comment.update comment_params
---
UPDATE "comments" SET "description" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["description", "Agora outra descrição"], ["updated_at", "2015-05-22 01:20:47.371822"], ["id", 1]]

    def destroy
        respond_to do |format|
            if @comment
                @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]

    def set_comment
        @comment = Comment.find_by_id(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 3]]