app/controllers/api/v1/disagrees_controller.rb

INSERT INTO "disagrees" ("user_id", "opinion_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["opinion_id", 1], ["created_at", "2015-05-22 01:30:39.650869"], ["updated_at", "2015-05-22 01:30:39.650869"]]
---
    def create
        @disagree = Disagree.new disagree_params
        respond_to do |format|
            if @disagree.save

DELETE FROM "disagrees" WHERE "disagrees"."id" = ?  [["id", 3]]
---
    def destroy
        respond_to do |format|
            if @disagree
                @disagree.destroy

SELECT  "disagrees".* FROM "disagrees" WHERE "disagrees"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_disagree
        @disagree = Disagree.find_by_id(params[:id])