app/controllers/api/v1/users_controller.rb

    def create
        @user = User.new user_params
        respond_to do |format|
            if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Érico Dias"], ["email", "e@ea.ca"], ["password", "123123123"], ["created_at", "2015-05-22 01:03:35.998016"], ["updated_at", "2015-05-22 01:03:35.998016"]]

    def update
        respond_to do |format|
            if @user.update user_params
---
UPDATE "users" SET "name" = ?, "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Érico Dias"], ["email", "e@ea.ca"], ["password", "123123123"], ["updated_at", "2015-05-22 01:05:26.643244"], ["id", 1]]

    def destroy
        respond_to do |format|
            if @user
                @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]

    def set_user
        @user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]